In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'worker_id': [1, 2, 3, 4, 5],
    'first_name': ['Monika', 'Niharika', 'Vishal', 'Amitah', 'Vivek'],
    'last_name': ['Arora', 'Verma', 'Singhal', 'Singh', 'Bhati'],
    'salary': [100000, 80000, 300000, 500000, 500000],
    'joining_date': ['2014-02-20 00:00:00', '2014-06-11 00:00:00', '2014-02-20 00:00:00', '2014-02-20 00:00:00', '2014-06-11 00:00:00'],
    'department': ['HR', 'Admin', 'HR', 'Admin', 'Admin']
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00      Admin

#### How would you use count to find the total number of rows in the DataFrame?

In [5]:
df.count(axis=0)

worker_id       5
first_name      5
last_name       5
salary          5
joining_date    5
department      5
dtype: int64

#### How can you use count to find the number of non-NA/null entries in the 'salary' column?

In [6]:
df['salary'].count() #using series count method

5

#### How would you apply count to find the number of non-NA/null entries for each column in the DataFrame?

In [7]:
df.iloc[4, 5] = np.nan

In [8]:
df

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00        NaN

In [9]:
df.count()

worker_id       5
first_name      5
last_name       5
salary          5
joining_date    5
department      4
dtype: int64

#### Can you use count along with groupby to find out how many workers are in each department?

In [10]:
df.groupby(['department']).apply('count').loc[:, ['worker_id']]

            worker_id
department
Admin               2
HR                  2

#### How can you use count to find out how many unique 'joining_date' values are present in the DataFrame?

In [11]:
df

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00        NaN

In [12]:
df['joining_date'].nunique()

2

#### How would you use count to determine the number of workers who have a salary greater than 100,000?

In [13]:
df.loc[df['salary']>100000, ['salary']].count()

salary    3
dtype: int64

#### Is it possible to use count to find the number of workers with the last name 'Singh'? How would you do it?

In [14]:
df

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00        NaN

In [15]:
df.loc[df['last_name'] == 'Singh', ['first_name', 'last_name']].count()

first_name    1
last_name     1
dtype: int64

#### Can you apply count to find the number of rows where both 'first_name' and 'last_name' are non-NA/null?

In [16]:
df

   worker_id first_name last_name  salary         joining_date department
0          1     Monika     Arora  100000  2014-02-20 00:00:00         HR
1          2   Niharika     Verma   80000  2014-06-11 00:00:00      Admin
2          3     Vishal   Singhal  300000  2014-02-20 00:00:00         HR
3          4     Amitah     Singh  500000  2014-02-20 00:00:00      Admin
4          5      Vivek     Bhati  500000  2014-06-11 00:00:00        NaN

In [17]:
df.loc[df['first_name'].notna() & df['last_name'].notna(), ['first_name', 'last_name']].count()

first_name    5
last_name     5
dtype: int64

#### How would you use count to find the number of workers who joined before a certain date, for example, '2014-05-01'?

In [18]:
df.dtypes

worker_id        int64
first_name      object
last_name       object
salary           int64
joining_date    object
department      object
dtype: object

In [19]:
df['joining_date'] = pd.to_datetime(df['joining_date'])

In [20]:
df.dtypes

worker_id                int64
first_name              object
last_name               object
salary                   int64
joining_date    datetime64[ns]
department              object
dtype: object

In [21]:
df

   worker_id first_name last_name  salary joining_date department
0          1     Monika     Arora  100000   2014-02-20         HR
1          2   Niharika     Verma   80000   2014-06-11      Admin
2          3     Vishal   Singhal  300000   2014-02-20         HR
3          4     Amitah     Singh  500000   2014-02-20      Admin
4          5      Vivek     Bhati  500000   2014-06-11        NaN

In [22]:
df.loc[df['joining_date'] < '2014-05-01', :].count()

worker_id       3
first_name      3
last_name       3
salary          3
joining_date    3
department      3
dtype: int64